# Subqueries Where Lab

### Introduction

In this lesson, we'll work through a leetcode problem that can be solved using a subquery.  Let's get started.

### Loading our Data

First, we'll load our data into the database.

In [24]:
import pandas as pd
def build_dataframe(data):
    columns = data['headers']
    values = data['values']
    df = pd.DataFrame(values)
    df.columns = columns
    return df

In [25]:
customers = {"headers": ["id", "name"], "values": [[1, "Joe"], [2, "Henry"], [3, "Sam"], [4, "Max"]]}

In [26]:
orders = {"headers": ["id", "customerId"], "values": [[1, 3], [2, 1]]}

In [27]:
customers_df = build_dataframe(customers)

In [28]:
orders_df = build_dataframe(orders)

In [29]:
import sqlite3

conn = sqlite3.connect('crm.db')

In [30]:
customers_df.to_sql('customers', conn, if_exists = 'replace', index = False)
orders_df.to_sql('orders', conn, if_exists = 'replace', index = False)

2

### Viewing our data

So as you can see, that we now have two tables loaded - customers and orders.

In [20]:
pd.read_sql('select * from customers', conn)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [21]:
pd.read_sql('select * from orders', conn)

   id  customerId
0   1           3
1   2           1

### Problem

> Write an SQL query to report all customers who never order anything.

In [23]:
pd.read_sql('select * from customers where customers.id not in (select distinct customerId from orders)', conn)

# 	id	name
# 0	2	Henry
# 1	4	Max

   id   name
0   2  Henry
1   4    Max